export const regular = {
  // 账号
  account: /^\w{4,16}$/,  // 4-16位，字母下划线数字减号
  // 手机号
  mobile: /^1[3-9]\d{9}$/,
  // 邮箱
  email: /^([a-zA-Z0-9_-])+@([a-zA-Z0-9_-])+(\.[a-zA-Z0-9_-])+/,
  // 密码
  // password: /^(?=.*[a-z])(?=.*[A-Z])(?=.*\d)(?=.*?[#?!@$%^&*-._]).{6,}$/,   // 最少6位，至少包括一个大写字母，一个小写字母，一个数字，一个特殊字符
  // password: /^(?![0-9]+$)(?![a-zA-Z]+$)[0-9A-Za-z]{6,18}$/,                 // 密码必须包含字母和数字，且在6-18位之间
  password: /^(?=.*[a-zA-Z])(?=.*\d).{6,}$/,                                   // 最少6位，至少包括一个英文和一个数字
  // 身份证号,包括15位和18位的
  IDCard: /^[1-9]\d{5}(18|19|([23]\d))\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$/,
  // 证件号
  IDNumber: /^[a-z0-9A-Z]{0,50}$/,
  // QQ号
  qq: /^[1-9]\d{4,11}$/,
  // 网址, 仅支持http和https开头的
  url: /^(http|https):\/\/[\w\-_]+(\.[\w\-_]+)+([\w\-.,@?^=%&:/~+#]*[\w\-@?^=%&/~+#])?$/,
  // 银行卡号
  bankCard: /^[0-9]\d{9,19}$/,
  // 座机
  telephone: /^\d{3}-\d{7,8}|\d{4}-\d{7,8}$/,
  // 金额格式验证
  amountFormat: /(?:^[1-9]([0-9]+)?(?:\.[0-9]{1,2})?$)|(?:^(?:0){1}$)|(?:^[0-9]\.[0-9](?:[0-9])?$)/,

  // 英文
  english: /^.[A-Za-z]+$/,
  // 数字和换行符
  numLinefeed: /^[0-9\n*]+$/,
  // 验证正整数
  naturalNumber: / (^ [1 - 9]\d* $) /,
  // 验证正整数或0
  naturalNumberOrZero: /(^[0-9]\d*$)/,
  // 大于等于0小于等于100的正数
  numberZeroToHundred: /^100$|^(\d|[1-9]\d)(\.\d+)*$/,
  // 0到20位的英文字符和数字
  enNum0to20: /^[a-z0-9A-Z]{0,20}$/,
  // 2到100位的中英文字符和空格
  cnEnSpace2to100: /^[a-zA-Z\u4E00-\u9FA5\s*]{2,100}$/,
  // 255位以内的字符
  char0to255: /^.{0,255}$/,
}

